
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2025.1.110.2.15
# Date: 2025-07-25 18:42

# Copyright (C) 2013 - 2025 Efinix Inc. All rights reserved.

# Device: T120F576
# Project: testing_PLLs
# Timing Model: C3 (final)

# PLL Constraints
#################
create_clock -period 10.000 -name clk_0 [get_ports {clk_0}]
create_clock -period 20.000 -name clk_1 [get_ports {clk_1}]
create_clock -period 10.000 -name clk [get_ports {clk}]

# GPIO Constraints
####################

# JTAG Constraints
####################
# create_clock -period <USER_PERIOD> -name bscan_TCK [get_ports {bscan_TCK}]
set_output_delay -clock bscan_TCK -max 0.144 [get_ports {bscan_TDO}]
set_output_delay -clock bscan_TCK -min -0.053 [get_ports {bscan_TDO}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.347 [get_ports {bscan_CAPTURE}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_CAPTURE}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.347 [get_ports {bscan_RESET}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_RESET}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.300 [get_ports {bscan_SEL}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.116 [get_ports {bscan_SEL}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.347 [get_ports {bscan_UPDATE}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_UPDATE}]
set_input_delay -clock_fall -clock bscan_TCK -max 0.417 [get_ports {bscan_SHIFT}]
set_input_delay -clock_fall -clock bscan_TCK -min 0.161 [get_ports {bscan_SHIFT}]
# JTAG Constraints (extra... not used by current Efinity debug tools)
# create_clock -period <USER_PERIOD> -name bscan_DRCK [get_ports {bscan_DRCK}]
# set_input_delay -clock_fall -clock bscan_TCK -max 0.347 [get_ports {bscan_RUNTEST}]
# set_input_delay -clock_fall -clock bscan_TCK -min 0.134 [get_ports {bscan_RUNTEST}]
# Create separate clock groups for JTAG clocks. Remove DRCK clock from the list below if it is not defined.
# set_clock_groups -asynchronous -group {bscan_TCK bscan_DRCK}
